In [13]:
import os
import pandas as pd
import numpy as np

In [14]:
#Read in files
csv_path_schools = os.path.join("..","Resources","raw_data","schools_complete.csv")
csv_path_students = os.path.join("..","Resources","raw_data","students_complete.csv")

school_data = pd.read_csv(csv_path_schools)
student_data = pd.read_csv(csv_path_students)

In [15]:
student_data.count()

Student ID       39170
name             39170
gender           39170
grade            39170
school           39170
reading_score    39170
math_score       39170
dtype: int64

In [16]:
school_data.count()

School ID    15
name         15
type         15
size         15
budget       15
dtype: int64

In [17]:
def format_to_dollars( series_to_change ):  
    series_to_change=series_to_change.map("${:,}".format)
    return series_to_change;

school_data["budget"]=format_to_dollars(school_data["budget"])

school_data.head()

   School ID                   name      type  size      budget
0          0      Huang High School  District  2917  $1,910,635
1          1   Figueroa High School  District  2949  $1,884,411
2          2    Shelton High School   Charter  1761  $1,056,600
3          3  Hernandez High School  District  4635  $3,022,020
4          4    Griffin High School   Charter  1468    $917,500

In [18]:
def format_to_plain_number(series_to_change):
    series_to_change=series_to_change.replace({'\%': '','\$': '', ',': ''}, regex=True)
    series_to_change = series_to_change.apply(pd.to_numeric)
    return series_to_change;

school_data["budget"]=format_to_plain_number(school_data["budget"])
school_data.head()

   School ID                   name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [19]:
school_data["budget"]=format_to_dollars(school_data["budget"])
school_data.head()

   School ID                   name      type  size      budget
0          0      Huang High School  District  2917  $1,910,635
1          1   Figueroa High School  District  2949  $1,884,411
2          2    Shelton High School   Charter  1761  $1,056,600
3          3  Hernandez High School  District  4635  $3,022,020
4          4    Griffin High School   Charter  1468    $917,500

In [20]:
school_data["budget"]=format_to_plain_number(school_data["budget"])
school_data.head()

   School ID                   name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [21]:
def format_to_perc(series_to_change):  
    series_to_change=series_to_change.map("{:,.2f}%".format)
    return series_to_change;

student_data["math_score"]=format_to_perc(student_data["math_score"])
student_data.head()

,Student ID,name,gender,grade,school,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79.00%
1,1,Victor Smith,M,12th,Huang High School,94,61.00%
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60.00%
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58.00%
4,4,Bonnie Ray,F,9th,Huang High School,97,84.00%

In [22]:
#student_data["math_score"]=format_to_plain_number(student_data["math_score"])
for x in student_data:
    student_data[x]=format_to_plain_number(student_data[x])
student_data.head()

TypeError: Cannot compare types 'ndarray(dtype=int64)' and 'str'